GREETINGS = 'Добро Пожаловать!'

MAIN_MENU = '''Выберите необходимую операцию:

1. Показать все заметки
2. Показать одну заметку
3. Добавить новую заметку
4. Редактировать заметку
5. Удалить заметку
6. Выйти из приложения'''

GOODBYE = 'До Новых Встреч!'

INPUT_NAME_MESSAGE = 'Пожалуйста, введите название заметки: '
INPUT_CONTENT_MESSAGE = 'Пожалуйста, введите тело заметки: '
INPUT_ID_MESSAGE = 'Пожалуйста, введите ID искомой заметки: '

NOT_FOUND_ID_ERROR = 'Заметка с указанным ID не найдена!'
INPUT_ID_ERROR = 'Вы должны ввести ID заметки(число)!'
INPUT_CHOICE_ERROR = 'Вы должны выбрать номер операции из списка!'
INPUT_DATA_ERROR = 'Нельзя вводить пустые строки!Проверьте введённые данные!'
EMPTY_NOTES = 'Список заметок пуст!'
PRESS_SPACE = 'Нажмите "Пробел" для продолжения...'

DEL_SUCCESS = 'Заметка успешно удалена!'
ADD_SUCCESS = 'Заметка успешно добавлена!'
EDIT_SUCCESS = 'Заметка успешно изменена!'

ID_TEXT = 'ID заметки: '
NAME_TEXT = 'Название заметки: '
CONTENT_TEXT = 'Содержание: '
CREATE_REDACT_TEXT = 'Дата создания/редактирования: '